start = """
Привет.
Это бот @asicfire

📲 Если вам требуется срочно продать устройство - заполните объявление, и мы разместим его в удобном формате

💬 Узнать информацию о продавце - @asicfirechat
"""

error_not_text = """
Упс, что то пошло не так :(
Напишите сообщение текстом и попробуйте снова
"""

end = "👌 Ваше объявление проходит проверку администратором."

post_template = """
<b>Продавец</b>: {}
<b>Товар</b>: {}
<b>Количество</b>: {}
<b>Состояние</b>: {}
<b>Цена</b>: {} {}
<b>Город</b>: {}
<b>Доставка тп</b>: {}
<b>Комментарий</b>: {}

<b>Контактные данные</b>:
{}
{}

💬 <b>Обсудить</b> @asicfirechat
📲 <b>Продать</b> @asicfirebot
"""

ecosystem_poolproof_text = """
Экосистема poolproof.tech предлагает решения для майнеров.

POOLPROOF | BOT - бот экосистемы.
История доходности майнинг-пулов, AML-проверки добываемой криптовалюты, техподдержка майнеров. 

THE MINERS CLUB - первая NFT коллекция от майнеров для майнеров на TON Blockchain

Реальная доходность пулов - ежедневная доходность популярных майнинг-пулов
Журнал майнера - новости индустрии майнинга
AsicFire - доска объявления по продаже оборудования
Service - гарантийный ремонт Whatsminer, Antminer, Jasminer. Техподдержка.
"""

faq_text = """
🔽 Пожалуйста, прочитайте это перед размещением объявления 

▫️ Анкета требуется, чтобы объявление было сформировано в читабельный для всех формат.

▫️ Мы просим вас оставить номер, чтобы покупателю было проще связаться.

▫️ Если не хотите оставлять номер, то напишите 70000000000 (десять нулей), но такие объявления реже проходят верификацию от админа.

▫️ В комментарии напишите любую дополнительную информацию. Если вы опубликуете ссылку - объявление не пройдет верификацию. Если у вас есть вопросы по рекламной интеграции компании - напиши администраторам.
"""
